<a href="https://colab.research.google.com/github/KKugi/machine-learning-programming/blob/main/10_13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### pandas

In [ ]:
import pandas as pd

In [ ]:
path = 'http://github.com/dknife/ML/raw/main/data/'
weather_file = path + 'weather.csv'

In [ ]:
weather = pd.read_csv(weather_file, index_col=0, encoding='CP949')
weather

            평균기온  최대풍속  평균풍속
일시
2010-08-01  28.7   8.3   3.4
2010-08-02  25.2   8.7   3.8
2010-08-03  22.1   6.3   2.9
2010-08-04  25.3   6.6   4.2
2010-08-05  27.2   9.1   5.6
...          ...   ...   ...
2020-07-27  22.1   4.2   1.7
2020-07-28  21.9   4.5   1.6
2020-07-29  21.6   3.2   1.0
2020-07-30  22.9   9.7   2.4
2020-07-31  25.7   4.8   2.5

[3653 rows x 3 columns]

In [ ]:
print(weather.head(3))
print('weather 데이터의 shape :', weather.shape)

            평균기온  최대풍속  평균풍속
일시
2010-08-01  28.7   8.3   3.4
2010-08-02  25.2   8.7   3.8
2010-08-03  22.1   6.3   2.9
weather 데이터의 shape : (3653, 3)

In [ ]:
weather.count()

평균기온    3653
최대풍속    3649
평균풍속    3647
dtype: int64

In [ ]:
missing_data = weather[weather['평균풍속'].isna()]
print(missing_data)

            평균기온  최대풍속  평균풍속
일시
2012-02-11  -0.7   NaN   NaN
2012-02-12   0.4   NaN   NaN
2012-02-13   4.0   NaN   NaN
2015-03-22  10.1  11.6   NaN
2015-04-01   7.3  12.1   NaN
2019-04-18  15.7  11.7   NaN

In [ ]:
missing_data1 = weather[weather['최대풍속'].isna()]
print(missing_data1)

            평균기온  최대풍속  평균풍속
일시
2012-02-11  -0.7   NaN   NaN
2012-02-12   0.4   NaN   NaN
2012-02-13   4.0   NaN   NaN
2019-04-19   7.8   NaN   2.3

In [ ]:
# weather.fillna(0,inplace=True)
# print(weather.loc['2012-02-11'])

In [ ]:
weather['평균풍속'].mean()

3.936440910337254

In [ ]:
weather.fillna(weather['평균풍속'].mean(),inplace = True) # 기존 데이터에 덮어쓰기 한다.
print(weather.loc['2012-02-11'])

평균기온   -0.700000
최대풍속    3.936441
평균풍속    3.936441
Name: 2012-02-11, dtype: float64

- groupby()

In [ ]:
weather = pd.read_csv(weather_file, encoding='CP949')

In [ ]:
weather['month'] = pd.DatetimeIndex(weather['일시']).month
means = weather.groupby('month').mean()
print(means)

            평균기온      최대풍속      평균풍속
month
1       1.598387  8.158065  3.757419
2       2.136396  8.225357  3.946786
3       6.250323  8.871935  4.390291
4      11.064667  9.305017  4.622483
5      16.564194  8.548710  4.219355
6      19.616667  6.945667  3.461000
7      23.328387  7.322581  3.877419
8      24.748710  6.853226  3.596129
9      20.323667  6.896333  3.661667
10     15.383871  7.766774  3.961613
11      9.889667  8.013333  3.930667
12      3.753548  8.045484  3.817097

In [ ]:
means['평균풍속'] >= 4.0

month
1     False
2     False
3      True
4      True
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
Name: 평균풍속, dtype: bool

In [ ]:
means[means['평균풍속']>=4.0]

            평균기온      최대풍속      평균풍속
month
3       6.250323  8.871935  4.390291
4      11.064667  9.305017  4.622483
5      16.564194  8.548710  4.219355

### Pivot and Concat
- pandas는 데이터 분석을 하다보면 테이블에서 행과열의 위치를 바꾼다던가, 어떤 기준을 정해서 집계를 해서 테이블 구조를 변경해야하는 경우를 위해 테이블 구조를 변경하는 함수를 제공하는데 대표적으로 pivot()함수이다.

In [ ]:
import pandas as pd

In [ ]:
df_1 = pd.DataFrame({'item':['ring0','ring0','ring1','ring1'],
                     'type':['Gold','Silver','Gold','Broze'],
                     'price':[2000,10000,50000,30000]})
df_1

    item    type  price
0  ring0    Gold   2000
1  ring0  Silver  10000
2  ring1    Gold  50000
3  ring1   Broze  30000

- index = 'item'으로 하여 item 열을 인덱스로 사용하고 columns = 'type'으로 열을 변경함

In [ ]:
df_2 = df_1.pivot(index = 'item', columns = 'type', values = 'price')
df_2

type     Broze     Gold   Silver
item
ring0      NaN   2000.0  10000.0
ring1  30000.0  50000.0      NaN

#### 일반적으로 데이터들은 작은 테이블로 나누어져 있는 경우
- 데이터를 하나로 합치는 방법 가운데 하나인 concat()함수

In [ ]:
df_3 = pd.DataFrame({'A':['a10','a11','a12'],
                     'B':['b10','b11','b12'],
                     'C':['c10','c11','c12']},
                    index = ['가','나','다'])

df_4 = pd.DataFrame({'B':['b23','b24','b25'],
                     'C':['c23','c24','c25'],
                     'D':['d23','d24','d25']},
                    index = ['다','라','마'])

In [ ]:
df_3

     A    B    C
가  a10  b10  c10
나  a11  b11  c11
다  a12  b12  c12

In [ ]:
df_4

     B    C    D
다  b23  c23  d23
라  b24  c24  d24
마  b25  c25  d25

In [ ]:
df_5 = pd.concat([df_3, df_4])
df_5

     A    B    C    D
가  a10  b10  c10  NaN
나  a11  b11  c11  NaN
다  a12  b12  c12  NaN
다  NaN  b23  c23  d23
라  NaN  b24  c24  d24
마  NaN  b25  c25  d25

In [ ]:
df_6 = pd.concat([df_3, df_4],axis=1,join='inner')
df_6

     A    B    C    B    C    D
다  a12  b12  c12  b23  c23  d23

In [ ]:
df_7 = pd.concat([df_3, df_4],axis=0,join='outer')
df_7

     A    B    C    D
가  a10  b10  c10  NaN
나  a11  b11  c11  NaN
다  a12  b12  c12  NaN
다  NaN  b23  c23  d23
라  NaN  b24  c24  d24
마  NaN  b25  c25  d25

### merge
- 데이터베이스는 조인(join)이라는 연산을 가짐
- 조인 연산과 같은 방식의 데이터 병합을 지원하는 판다스 함수가 merge()함수 이다.
#### Data.Frame.merge(right,how='inner',on=None)
- righe: 현재의 데이터프레임과 결합할 데이터프레임
- how: 결합의 방식 'left', 'right', 'inner', 'outer' 가능
- on: 조인 연산을 수행하기 위해 사용할 레이블(두 데이터프레임 모두에 존재해야 함)

In [ ]:
print(df_3)
print(df_4)

     A    B    C
가  a10  b10  c10
나  a11  b11  c11
다  a12  b12  c12
     B    C    D
다  b23  c23  d23
라  b24  c24  d24
마  b25  c25  d25

In [ ]:
print('left outer \n', df_3.merge(df_4, how='left', on='B'))
print('right outer \n', df_3.merge(df_4, how='right', on='B'))
print('full outer \n', df_3.merge(df_4, how='outer',on='B'))
print('inner \n', df_3.merge(df_4, how='inner', on='B'))

left outer
      A    B  C_x  C_y    D
0  a10  b10  c10  NaN  NaN
1  a11  b11  c11  NaN  NaN
2  a12  b12  c12  NaN  NaN
right outer
      A    B  C_x  C_y    D
0  NaN  b23  NaN  c23  d23
1  NaN  b24  NaN  c24  d24
2  NaN  b25  NaN  c25  d25
full outer
      A    B  C_x  C_y    D
0  a10  b10  c10  NaN  NaN
1  a11  b11  c11  NaN  NaN
2  a12  b12  c12  NaN  NaN
3  NaN  b23  NaN  c23  d23
4  NaN  b24  NaN  c24  d24
5  NaN  b25  NaN  c25  d25
inner
 Empty DataFrame
Columns: [A, B, C_x, C_y, D]
Index: []

- 'outer'방식이 기본
- 'left'는 'outer'조인의 결과에서 왼쪽 데이터 프레임에 존재하는 키를 가진 것만 뽑아내면 되고, 'right'는 오른쪽 테이블에서 발견되는 키를 가진 것만 뽑으면 된다.
- 'inner'는 왼쪽과 오른쪽 테이블 모두에서 발견되는 키를 가져야 추출되는데, 여기에서는 공백
-'B'뿐만이 아니라 'C'테이블도 두 테이블에 동시에 나타남

In [ ]:
df_8 = df_3.merge(df_4,how='outer',on='B')
print(df_8) # 왼쪽 테이블에서 가져온 것은 'C_x', 오른쪽에서 가져온 것은 'C_y'로 이름을 새로 붙여 테이블을 만든다.

     A    B  C_x  C_y    D
0  a10  b10  c10  NaN  NaN
1  a11  b11  c11  NaN  NaN
2  a12  b12  c12  NaN  NaN
3  NaN  b23  NaN  c23  d23
4  NaN  b24  NaN  c24  d24
5  NaN  b25  NaN  c25  d25

- 인덱스를 모두 사용하여 병합의 키가 되도록 하는 방식
- 'outer'방식이므로 두 인덱스의 합집합이 새로운 인덱스가 된다.
-'inner'라면 교집합으로 '다'행만 남게된다.

In [ ]:
df_9 = df_3.merge(df_4, how='outer',
                  left_index=True, right_index=True)
print(df_9)

     A  B_x  C_x  B_y  C_y    D
가  a10  b10  c10  NaN  NaN  NaN
나  a11  b11  c11  NaN  NaN  NaN
다  a12  b12  c12  b23  c23  d23
라  NaN  NaN  NaN  b24  c24  d24
마  NaN  NaN  NaN  b25  c25  d25